tutorials/multiphase/interPhaseChangeDyMFoam/propeller/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
<<<<<<< HEAD
|  \\    /   O peration     | Version:  3.0.x                                 |
=======
|  \\    /   O peration     | Version:  4.x                                   |
>>>>>>> 90e2f8d87bcd3a8588545c2de68a62d5b5c54a99
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//innerCylinder.obj
//{
//    #include "surfaceFeatureExtractDictDefaults"
//}


innerCylinderSmall.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


outerCylinder.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem1.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem2.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerStem3.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


propellerTip.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


// ************************************************************************* //
